caseSample/0/Ca
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ca;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;


boundaryField
{
    RockFace
    {
	type			groovyBC;
	variables "D__Ca=1e-9;r=.000002;gradCa=r*HCl/(D__Ca);";
	valueExpression 	"0";
	gradientExpression 	"gradCa";
	fractionExpression 	"0";
	value			uniform 0;
    }
    around
    {
        type            zeroGradient;
    }
    agitator
    {
        type            zeroGradient;
    }
    topr
    {
        type            zeroGradient;
    }

    bottomr
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
