caseSample/0/HCl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      HCl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0034802;


boundaryField
{
    RockFace
    {
	type			groovyBC;
        variables "D__HCl=1e-5;k=2.6e-6;m=0.44;grad=-1*k*pow(mag(HCl),m)/D__HCl;val1=grad;";
	valueExpression 	"0";
	gradientExpression 	"val1";
	fractionExpression 	"0";
	value			uniform 0.0034802;
    }
    around
    {
        type            zeroGradient;
    }
    agitator
    {
        type            zeroGradient;
    }
    topr
    {
        type            zeroGradient;
    }
    bottomr
    {
        type            zeroGradient;
    }
}



// ************************************************************************* //
