caseSample/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{


    RockFace
    {
         type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    around
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topr
    {
        type            slip;
    }
    agitator
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    bottomr
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
