caseSample/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "44";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
165290
(
6.364024263434e-11
-6.364014339731e-11
1.034991056014e-06
-1.034991056113e-06
1.894551502979e-10
-1.258148196147e-10
1.034877550042e-06
-1.03487755013e-06
...
)
;

boundaryField
{
    bottomr
    {
        type            calculated;
        value           uniform 0;
    }
    around
    {
        type            calculated;
        value           nonuniform List<scalar> 
1980
(
5.121532383475e-19
5.121512188636e-19
5.121512188636e-19
5.121512188636e-19
5.121512188636e-19
5.121512188636e-19
5.117957896941e-19
7.319781017206e-19
...
)
;
    }
    RockFace
    {
        type            calculated;
        value           nonuniform List<scalar> 
1585
(
0
0
-1.504632769053e-36
0
0
0
-1.504632769053e-36
0
...
)
;
    }
    agitator
    {
        type            calculated;
        value           nonuniform List<scalar> 
600
(
-3.827325920192e-24
-6.560899350738e-24
-6.560899350738e-24
-3.827325920192e-24
-9.531964089967e-25
-6.560899350738e-24
-3.827325920192e-24
-6.560899350738e-24
...
)
;
    }
    topr
    {
        type            calculated;
        value           nonuniform List<scalar> 
600
(
-1.962009032014e-18
-1.068242917101e-18
-3.739787046153e-19
-3.874876156301e-18
-6.377018276857e-19
2.615353539007e-17
-9.147057093055e-19
-2.362568348662e-18
...
)
;
    }
}


// ************************************************************************* //
