caseSample/system/blockMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
//for bottom cube
    (-4 -4 0)	//0
    (4  -4 0)	//1
    (4   4 0)	//2
    (-4  4 0)	//3
    (-4 -4 40)	//4
    (4  -4 40)	//5
    (4   4 40)	//6
    (-4  4 40)	//7


    (10.960155  -10.960155 0)	//8
    (10.960155   10.960155 0)	//9
    (10.960155  -10.960155 40)	//10
    (10.960155   10.960155 40)	//11
    (-10.960155 -10.960155 0)	//12
    (-10.960155 -10.960155 40)	//13
    (-10.960155  10.960155 0)	//14
    (-10.960155  10.960155 40)	//15

    (24.748737  -24.748737 0)		//16
    (24.748737  -24.748737 40)	//17
    (24.748737   24.748737 0)		//18
    (24.142135   24.748737 40)	//19
    (-24.748737  24.748737 0)		//20
    (-24.748737  24.748737 40)	//21
    (-24.748737  -24.748737 0)		//22
    (-24.748737  -24.748737 40)	//23

    (10.960155     -10.960155    70)	//24
    (10.960155      10.960155    70)	//25
    (-10.960155     10.960155    70)	//26
    (-10.960155    -10.960155    70)	//27
    (24.748737  -24.748737 70)	//28
    (24.748737   24.748737 70)	//29
    (-24.748737  24.748737 70)	//30
    (-24.748737 -24.748737 70)	//31

/*    (5.3033     -5.3033    30)	//32
    (5.3033      5.3033    30)	//33
    (-5.3033     5.3033    30)	//34
    (-5.3033    -5.3033    30)	//35
    (14.142135  -14.142135 30)	//36
    (14.142135   14.142135 30)	//37
    (-14.142135  14.142135 30)	//38
    (-14.142135 -14.142135 30)	//39

    (-4 -4 25)		//40
    (4  -4 25)		//41
    (4   4 25)		//42
    (-4  4 25)		//43
    (-4 -4 30)		//44
    (4  -4 30)		//45
    (4   4 30)		//46
    (-4  4 30)		//47

*/
);
//first boundary Layer Thickness .04 mm
blocks
(
	hex (0 1 2 3 4 5 6 7) (12 12  20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (1 8 9 2 5 10 11 6) (8  12  20) 		
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (12 8 1 0 13 10 5 4) (12 8   20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (12 0 3 14 13 4 7 15) (8  12  20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (3  2 9 14 7 6 11 15) (12 8   20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (8  16 18 9 10 17 19 11) (8 12  20) 		
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (14 9  18 20 15 11 19 21) (12 8 20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (22 12 14 20 23 13 15 21) (8 12  20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )
	hex (22 16 8 12 23 17 10 13) (12 8  20) 
		simpleGrading (	
				1
				1 
				( (38 12 .5)
				( 1.8908 4 .15)
				( .1092    3  0.694444 )
				)
			      )

	hex (10 17 19 11 24 28 29 25) (8 12  13) simpleGrading (1 1 1)
	hex (15 11 19 21 26 25 29 30) (12 8  13) simpleGrading (1 1 1)
	hex (23 13 15 21 31 27 26 30) (8 12  13) simpleGrading (1 1 1)
	hex (23 17 10 13 31 28 24 27) (12 8  13) simpleGrading (1 1 1)

/*	hex (24 28 29 25 32 36 37 33) (9 10  3) simpleGrading (1 1 1)
	hex (26 25 29 30 34 33 37 38) (10 9  3) simpleGrading (1 1 1)
	hex (31 27 26 30 39 35 34 38) (9 10  3) simpleGrading (1 1 1)
	hex (31 28 24 27 39 36 32 35) (10 9  3) simpleGrading (1 1 1)

	hex (40 41 42 43 44 45 46 47) (10 10  3) simpleGrading (1 1 1)
	hex (41 24 25 42 45 32 33 46) (2  10  3) simpleGrading (1 1 1)
	hex (27 24 41 40 35 32 45 44) (10 2   3) simpleGrading (1 1 1)
	hex (27 40 43 26 35 44 47 34) (2  10  3) simpleGrading (1 1 1)
	hex (43 42 25 26 47 46 33 34) (10 2   3) simpleGrading (1 1 1)
*/
);

edges
(
	arc 0 1 ( 0 -4.8 0)
	arc 4 5 ( 0 -4.8 40)
	arc 1 2 ( 4.8  0 0)
	arc 5 6 ( 4.8  0 40)
	arc 2 3 ( 0  4.8 0)
	arc 6 7 ( 0  4.8 40)
	arc 3 0 (-4.8  0 0)
	arc 7 4 (-4.8  0 40)
	arc 8 9 (15.5 0 0)
	arc 10 11 (15.5 0 40)
	arc 8 12  (0 -15.5 0)
	arc 10 13 (0 -15.5 40)
	arc 12 14 (-15.5 0 0)
	arc 13 15 (-15.5 0 40)
	arc 9  14 ( 0  15.5 0)
	arc 11 15 ( 0  15.5 40)

	arc 16 18 (35 0 0)
	arc 17 19 (35 0 40)
	arc 20 18 (0  35 0)
	arc 21 19 (0  35 40)
	arc 20 22 (-35 0 0)
	arc 21 23 (-35 0 40)
	arc 16 22 ( 0 -35 0)
	arc 17 23 ( 0 -35 40)

	arc 24 25 (15.5  0   70)
	arc 25 26 (0    15.5 70)
	arc 26 27 (-15.5 0   70)
	arc 27 24 (0   -15.5 70)
	arc 28 29 (35   0   70)
	arc 29 30 (0    35  70)
	arc 30 31 (-35  0   70)
	arc 31 28 (0   -35  70)

/*	arc 32 33 (7.5  0   30)
	arc 33 34 (0    7.5 30)
	arc 34 35 (-7.5 0   30)
	arc 35 32 (0   -7.5 30)
	arc 36 37 (20   0   30)
	arc 37 38 (0    20  30)
	arc 38 39 (-20  0   30)
	arc 39 36 (0   -20  30)

	arc 40 41 ( 0    -4.8  25)
	arc 41 42 ( 4.8   0    25)
	arc 42 43 ( 0     4.8  25)
	arc 43 40 (-4.8   0    25)
	arc 44 45 ( 0    -4.8  30)
	arc 45 46 ( 4.8   0    30)
	arc 46 47 ( 0     4.8  30)
	arc 47 44 (-4.8   0    30) */
);

boundary
(
    around
    {
        type patch;
        faces
        (
            (16 18 19 17)
            (18 20 21 19)
            (20 22 23 21)
            (22 16 17 23)
            (17 19 29 28)
            (19 21 30 29)
            (23 21 30 31)
            (23 17 28 31)
 /*           (29 28 36 37)
            (30 29 37 38)
            (30 31 39 38)
            (28 31 39 36) */
        );
    }
    agitator
    {
        type wall;
        faces
        (
            (10 11 25 24)
            (15 11 25 26)
            (13 15 26 27)
            (10 13 27 24)
/*            (40 41 42 43)
            (41 24 25 42)
            (27 24 41 40)
            (27 40 43 26)
            (43 42 25 26) */
	);
    }
    bottomr
    {
        type patch;
        faces
        (
            (0 1 2 3)
	    (0 1 8 12)
	    (1 2 9 8)
	    (2 3 14 9)
	    (3 0 12 14)
	    (8 16 18 9)
	    (14 9 18 20)
	    (22 12 14 20)
	    (22 16 8 12)
        );
    }


    topr
    {
        type patch;
        faces
        (
/*	    (32 36 37 33)
	    (34 33 37 38)
	    (39 35 34 38)
	    (39 36 32 35)
	    (44 45 46 47)
	    (45 32 33 46)
	    (35 32 45 44)
	    (35 44 47 34)
	    (47 46 33 34) */
	    (24 28 29 25)
	    (26 25 29 30)
	    (31 27 26 30)
	    (31 28 24 27)
        );
    }
    RockFace
    {
        type wall;
        faces
        (
            (4 5 6 7)
	    (4 5 10 13)
	    (5 6 11 10)
	    (6 7 15 11)
	    (7 4 13 15)
        );
    } 
);

mergePatchPairs
(
);


// ************************************************************************* //
