caseSample/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;
interpolationScheme cellPointFace;
setFormat       raw;

fields          ( HCl );

sets
(
    cone25
    {
        type    lineUniform;
        axis    x;
        start   (-0.0155 0 0.04);
        end     ( 0.0155 0 0.04);
        nPoints 250;
    }
);

// ************************************************************************* //
